In [152]:
import pandas as pd

# Series

In [153]:
data = [1, 2, 3, 4, 5]

In [154]:
s = pd.Series(data)

In [155]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [156]:
index = ['Linha' + str(i) for i in range(5)]

In [157]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [158]:
s = pd.Series(data = data, index = index)

In [159]:
s #Agora temos rótulos nas linhas

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [160]:
# Fazendo isso atraves de um dicionário

In [161]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [162]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [163]:
s = pd.Series(data)

In [164]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [165]:
s1 = s + 2

In [166]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [167]:
#Posso fazer operações com series com os mesmos indicies

In [168]:
s2 = s + s1

In [169]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

In [170]:
s3 = s2 + s

In [171]:
s3

Linha0     5
Linha1     8
Linha2    11
Linha3    14
Linha4    17
dtype: int64

In [172]:
s4 = s2 * 2

In [173]:
s4

Linha0     8
Linha1    12
Linha2    16
Linha3    20
Linha4    24
dtype: int64

In [174]:
# Se ele encontrar uma linha com o nome diferente ele retorna um resultado "Nan"

# DataFrame

In [175]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [176]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [177]:
df1 = pd.DataFrame(data = data)

In [178]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [179]:
index = ['Linha' + str(i) for i in range(3)]

In [180]:
index

['Linha0', 'Linha1', 'Linha2']

In [181]:
df1 = pd.DataFrame(data = data, index = index)

In [182]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [183]:
columns = ['Coluna' + str(i) for i in range(3)]

In [184]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [185]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [186]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Com um Dicionário

In [187]:
data = {'Coluna0':{'Linha0':1, 'Linha1':4, 'Linha2': 7},
        'Coluna1':{'Linha0':2, 'Linha1':5, 'Linha2': 8},
        'Coluna2':{'Linha0':3, 'Linha1':6, 'Linha2': 9}}

In [188]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [189]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [190]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Com uma lista de tuplas

In [191]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [192]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Concatenando DataFrames (em baixo ou ao lado)

In [193]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [194]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [195]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [196]:
df4 = pd.concat([df1, df2, df3])

In [197]:
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [198]:
df4 = pd.concat([df1, df2, df3], axis = 1)

In [199]:
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C